# Переменные
REMOTE_SERVER="user@192.168.31.83"

# Команда для мониторинга
ssh $REMOTE_SERVER <<EOF
echo "Мониторинг ресурсов на сервере $REMOTE_SERVER"
echo "-----------------------"
echo "Дата и время:"
date
echo "-----------------------"
echo "Использование CPU:"
top -b -n1 | grep "Cpu(s)"
echo "-----------------------"
echo "Использование памяти:"
free -h
echo "-----------------------"
echo "Использование диска:"
df -h
echo "-----------------------"
EOF

# Мониторинг системных ресурсов на сервере в PowerShell
ssh user@192.168.31.83 <<EOF
echo "Мониторинг ресурсов на сервере user@192.168.31.83"
echo "-----------------------"
echo "Дата и время:"
date
echo "-----------------------"
echo "Использование CPU:"
top -b -n1 | grep "Cpu(s)"
echo "-----------------------"
echo "Использование памяти:"
free -h
echo "-----------------------"
echo "Использование диска:"
df -h
echo "-----------------------"
EOF

